// 25.Найти сумму чисел от 1 до А или N
Console.WriteLine("введите число N");
int N = Convert.ToInt32(Console.ReadLine());
int sum = N * (N + 1) / 2;
Console.WriteLine("сумма чисел от 1 до "  + N + "=" + sum);




